/* eslint-disable max-len */
import { Container, Text, Title } from 'components/common';
import { PAGE_LEFT_PADDING, PAGE_MAX_WIDTH, PAGE_RIGHT_PADDING } from 'pages/constants';
import { createList } from 'pages/projects/common';
import ProjectsSidebar from 'pages/projects/ProjectsSidebar';
import React from 'react';

export const DoTheChange: React.FC = () => {
  return (
    <Container
      xs={PAGE_MAX_WIDTH}
      styleConfig={{
        gap: '2rem',
        direction: 'row',
        wrap: true,
        centered: true,
        padding: { left: PAGE_LEFT_PADDING, right: PAGE_RIGHT_PADDING, top: 'xl', bottom: 'xl' },
      }}
    >
      <Container xs={12} lg={9} styleConfig={{ gap: '15px' }}>
        <Title
          title="Do the change"
          description="Онлајн маратонот за слабеење е нов формат кој ќе ви помогне да си ги постигнете целитe и да направите најдобри резултати. "
        />
        {createList([
          'Подобри ги навиките во исхраната',
          'Поддршка за регулирање на тежината',
          'Следење на телесната композиција',
        ])}
        <Text>
          Меѓу придобивките од маратонот се постојаната поддршка од другите и здравиот натпреварувачки дух кој ќе ви
          помогне да постигнете најдобри резултати. Промената на навиките во исхраната, регулирањето на тежината и
          подобрувањето на здравите навики е многу полесно со тим и тренер отколку да сте сами!
        </Text>
        <Title
          title="Што се случува во тек на еден Маратон?"
          description={`Секој тим се состои од 9 луѓе, заедно со Капитенот. Капитенот е искусен Тренер кој споделува секојдневни совети и корисни материјали, креира индивидуализирани планови на оброци  и служи како пример и така им е поддршка на сите учесници.\n\nСекој „круг“ трае 10 дена и може да се повторува сè додека не се постигнат посакуваните резултати.  `}
          level={2}
        />
        <Title title="Правила за учество" level={2} />
        {createList([
          'Соработувајте со капитенот за да го пронајдете најсоодветниот план на оброци.',
          'Учесниците во Главниот тим заменуваат 2 главни оброци дневно со здрав оброк од Herbalife. Дел од она што вообичаено го пиете исто така треба да се замени со специјализирани производи (алоја, инстант енергетски чај) што можат да помогнат во постигнување оптимални нивоа на хидрација. ',
          'Мерете се секое утро и испратете му ги резултатите на Капитенот',
          'Водете Дневник за исхрана според принципот „касни, запиши. Запомнете дека ќе треба да се измерите наутро, затоа јадете одговорно во текот на денот!',
          'Вежбајте редовно.  Споделете ги успесите во вежбањето во групата за да ги мотивирате другите.',
          'Бидете фокусирани, доследни и дисциплинирани - ова е клучот за успех!',
          'И, се разбира, уживајте во процесот!*',
        ])}
      </Container>
      <Container xs={12} lg={3}>
        <ProjectsSidebar />
      </Container>
    </Container>
  );
};

export default DoTheChange;
